# for project documents, use addtional latex styles used in proposal file
:edit-this:
#+EXPORT_FILE_NAME: dbms-lab2-report
#+PROPERTY: header-args :eval no-export
# don't prompt to evaluate code blocks while exporting
#+OPTIONS: toc:nil 
# set toc below instead of here
#+LATEX_HEADER: \graphicspath{{/home/sujal/programming/college-files/assets/images/}}

# !!!!!!!!!!!!!          only edit this section       !!!!!!
#+LATEX_HEADER: \def\subjectNum{1}
# 1: DBMS
# 2: NM
# 3: OS
# 4: SCR
# 5: S.Eng

#+LATEX_HEADER: \def\labNum{2}
#+LATEX_HEADER: \def\labTitle{Constraints, Integrity \& WHERE clause}
#+LATEX_HEADER: \def\yearSem{II/IV}
#+LATEX_HEADER: \newif \iftoc
# !!!!!!!!!!!!           set toc here by uncommenting option
# \toctrue    
\tocfalse
:end:

#+INCLUDE: "/home/sujal/programming/college-files/assets/template.org" :lines "26-"
** Display all record of book whose price ranges from 2500 to 5000.
#+begin_src sql :results raw :exports both :cache yes
select * from book where price >= 2500 and price <= 5000
#+end_src

#+RESULTS:
|  bid | bname                  | author       | price |
|------+------------------------+--------------+-------|
|  905 | Supermarket            | Bobby Hall   |  3000 |
| 1043 | Letters from my father | Barack Obama |  2700 |

** Display all the records from booklist relation whose publication name starts from ‘P’ 
#+begin_src sql :results raw :exports both :cache yes
select * from booklist where publication like 'P%'
#+end_src

#+RESULTS:
| isbn | name         | publication   |
|------+--------------+---------------|
| 1145 | Born a Crime | Penguin books |

** Display all records from employee table whose name ends with ‘gh’ eg Hari Singh
#+begin_src sql :results raw :exports both :cache yes
select * from employee where ename like '%gh'
#+end_src

#+RESULTS:
| eid | ename       | salary | dateofemploy |
|-----+-------------+--------+--------------|
|   1 | Ram Singh   |   8000 |   2010-01-01 |
|   2 | Shyam Singh |   9000 |   2010-01-01 |

** Display iid and name from issues table whose name exactly consist of 9 characters.
#+begin_src sql :results raw :exports both :cache yes
select iid, name from issues where name like '_________'
#+end_src

#+RESULTS:
| iid | name      |
|-----+-----------|
|   1 | Ram Singh |

** Display all records from employee table where name starts with ‘S’ and salary greater than 8000.
#+begin_src sql :results raw :exports both :cache yes
select * from employee where ename like 'S%' AND salary > 8000
#+end_src

#+RESULTS:
| eid | ename       | salary | dateofemploy |
|-----+-------------+--------+--------------|
|   2 | Shyam Singh |   9000 |   2010-01-01 |

** Display all records from book table where either bid lies in range 1001 to 2000 or price range in 1000 to 2500.
#+begin_src sql :results raw :exports both :cache yes
select * from book where (bid between 1000 AND 2500) OR (price between 1000 AND 2500)
#+end_src

#+RESULTS:
|  bid | bname                  | author          | price |
|------+------------------------+-----------------+-------|
| 1043 | Letters from my father | Barack Obama    |  2700 |
| 1145 | Born a Crime           | Trevor Noah     |  1200 |
| 1243 | Death on the nile      | Agatha Christie |   800 |

** Display isbn number and bookname where booklist must not contain isbn no. 1043
#+begin_src sql :results raw :exports both :cache yes
select isbn, name from booklist where isbn != 1043
#+end_src

#+RESULTS:
| isbn | name              |
|------+-------------------|
|  905 | Supermarket       |
| 1145 | Born a Crime      |
| 1243 | Death on the nile |

